In [21]:
import pandas as pd
from sklearn.preprocessing import LabelEncoder

In [22]:
data = pd.read_excel('dataKasus-1.xlsx')
print(data)

      NO      NAMA   USIA  ...  SOSEK RENDAH PE/Non PE Unnamed: 12
0      1    NAMA 1  23 TH  ...          >UMR    Non PE         NaN
1      2    NAMA 2  29 TH  ...          >UMR        PE         NaN
2      3    NAMA 3  20 TH  ...          >UMR    Non PE         NaN
3      4    NAMA 4  18 TH  ...          >UMR    Non PE         NaN
4      5    NAMA 5  34 TH  ...          >UMR    Non PE         NaN
..   ...       ...    ...  ...           ...       ...         ...
556  558  NAMA 557  40 TH  ...          >UMR    Non PE         NaN
557  559  NAMA 558  28 TH  ...          >UMR    Non PE         NaN
558  560  NAMA 559  41 TH  ...          >UMR    Non PE         NaN
559  561  NAMA 560  32 TH  ...          >UMR    Non PE         NaN
560  562  NAMA 561  30 TH  ...          >UMR    Non PE         NaN

[561 rows x 13 columns]

In [23]:
data2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 554 entries, 0 to 560
Data columns (total 13 columns):
 #   Column                            Non-Null Count  Dtype
---  ------                            --------------  -----
 0   NO                                554 non-null    int64
 1   NAMA                              554 non-null    object
 2   USIA                              554 non-null    float64
 3   PARITAS                           554 non-null    int64
 4   JARAK KELAHIRAN                   554 non-null    int64
 5   RIW HIPERTENSI                    554 non-null    object
 6   RIW PE                            554 non-null    object
 7   OBESITAS                          554 non-null    object
 8   RIW DM                            554 non-null    object
 9   RIW HIPERTENSI/PE DALAM KELUARGA  554 non-null    object
 10  SOSEK RENDAH                      554 non-null    object
 11  PE/Non PE                         554 non-null    object
 12  JARAK KELAHIARAN                  554 non-null    object
dtypes: float64(1), int64(3), object(9)
memory usage: 60.6+ KB

In [24]:
data2 = data.drop(columns=['Unnamed: 12'])

In [25]:
def counts(nama):
  counts =  data2[nama].value_counts()
  return counts

In [26]:
counts('USIA')

USIA
28 TH     28
25 TH     24
31 TH     23
29 TH     22
24 TH     21
          ..
30 th      1
16         1
39 TH      1
13 TH      1
14 TH      1
Name: count, Length: 72, dtype: int64

In [27]:
data2['USIA'] = data2['USIA'].astype(str).str.replace(' TH', '')
data2['USIA'] = pd.to_numeric(data2['USIA'],errors='coerce')

In [28]:
counts('USIA')

USIA
28.0    29
26.0    24
25.0    24
29.0    24
31.0    23
24.0    21
27.0    20
30.0    19
23.0    17
22.0    16
33.0    16
21.0    14
20.0    13
36.0    11
32.0    10
35.0     9
34.0     9
41.0     8
37.0     7
39.0     6
38.0     6
19.0     5
40.0     4
18.0     4
15.0     3
16.0     3
17.0     3
43.0     2
13.0     1
14.0     1
Name: count, dtype: int64

In [29]:
mean_age = data2['USIA'].mean()
data2['USIA'].fillna(mean_age, inplace=True)
data2 = data2.dropna()

<ipython-input-29-f0feb19d35a8>:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data2['USIA'].fillna(mean_age, inplace=True)

In [30]:
counts('USIA')

USIA
27.994318    204
28.000000     29
25.000000     24
29.000000     24
31.000000     23
26.000000     23
27.000000     20
24.000000     20
30.000000     19
23.000000     17
33.000000     16
22.000000     16
21.000000     14
20.000000     13
36.000000     11
32.000000     10
35.000000      9
34.000000      9
41.000000      8
37.000000      7
39.000000      6
38.000000      6
19.000000      5
40.000000      4
18.000000      4
15.000000      3
16.000000      3
17.000000      3
43.000000      2
13.000000      1
14.000000      1
Name: count, dtype: int64

In [31]:
print(data2['USIA'])

0      23.0
1      29.0
2      20.0
3      18.0
4      34.0
       ...
556    40.0
557    28.0
558    41.0
559    32.0
560    30.0
Name: USIA, Length: 554, dtype: float64

In [32]:
data2['JARAK KELAHIRAN']=data2['JARAK KELAHIRAN'].replace('> 2 tahun ','> 2 tahun')

In [33]:
data2['JARAK KELAHIRAN']=LabelEncoder().fit_transform(data2['JARAK KELAHIRAN'])

In [34]:
counts('JARAK KELAHIRAN')

JARAK KELAHIRAN
2    260
1    213
0     81
Name: count, dtype: int64

In [36]:
data2['RIW HIPERTENSI'] = data2['RIW HIPERTENSI'].map({'Ya':1,'Tidak':0})

In [37]:
counts('RIW HIPERTENSI')

RIW HIPERTENSI
0    501
1     53
Name: count, dtype: int64

In [38]:
counts('RIW PE')

RIW PE
Tidak                     519
PEB                        19
PE                          6
HELLP SYNDROM               2
Impending PE                2
Impending Eklamsia          1
Kejang Konvulsi             1
impending eklamsia          1
PE, HELLP Syndrome          1
PEB impending eklampsi      1
Impending Ekalmsia          1
Name: count, dtype: int64

In [39]:
data2['RIW PE'] = data2['RIW PE'].apply(lambda x: 'Ya' if x != 'Tidak' else 'Tidak')
data2['RIW PE'] = data2['RIW PE'].map({'Ya':1,'Tidak':0})

In [40]:
counts('RIW PE')

RIW PE
0    519
1     35
Name: count, dtype: int64

In [42]:
data2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 554 entries, 0 to 560
Data columns (total 12 columns):
 #   Column                            Non-Null Count  Dtype
---  ------                            --------------  -----
 0   NO                                554 non-null    int64
 1   NAMA                              554 non-null    object
 2   USIA                              554 non-null    float64
 3   PARITAS                           554 non-null    int64
 4   JARAK KELAHIRAN                   554 non-null    int64
 5   RIW HIPERTENSI                    554 non-null    int64
 6   RIW PE                            554 non-null    int64
 7   OBESITAS                          554 non-null    object
 8   RIW DM                            554 non-null    object
 9   RIW HIPERTENSI/PE DALAM KELUARGA  554 non-null    object
 10  SOSEK RENDAH                      554 non-null    object
 11  PE/Non PE                         554 non-null    object
dtypes: float64(1), int64(5), object(6)
memory usage: 56.3+ KB

In [43]:
counts('RIW DM')

RIW DM
Tidak    549
Ya         5
Name: count, dtype: int64

In [44]:
columns_to_encode = ['OBESITAS', 'RIW DM']
for col in columns_to_encode:
    data2[col] = data2[col].map({'Ya': 1, 'Tidak': 0})

In [45]:
counts('RIW DM')

RIW DM
0    549
1      5
Name: count, dtype: int64

In [46]:
counts('OBESITAS')

OBESITAS
0    550
1      4
Name: count, dtype: int64

In [47]:
data2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 554 entries, 0 to 560
Data columns (total 12 columns):
 #   Column                            Non-Null Count  Dtype
---  ------                            --------------  -----
 0   NO                                554 non-null    int64
 1   NAMA                              554 non-null    object
 2   USIA                              554 non-null    float64
 3   PARITAS                           554 non-null    int64
 4   JARAK KELAHIRAN                   554 non-null    int64
 5   RIW HIPERTENSI                    554 non-null    int64
 6   RIW PE                            554 non-null    int64
 7   OBESITAS                          554 non-null    int64
 8   RIW DM                            554 non-null    int64
 9   RIW HIPERTENSI/PE DALAM KELUARGA  554 non-null    object
 10  SOSEK RENDAH                      554 non-null    object
 11  PE/Non PE                         554 non-null    object
dtypes: float64(1), int64(7), object(4)
memory usage: 56.3+ KB

In [48]:
data2['RIW HIPERTENSI/PE DALAM KELUARGA'] = data2['RIW HIPERTENSI/PE DALAM KELUARGA'].map({'Ada':1,'Tidak':0})

In [49]:
counts('RIW HIPERTENSI/PE DALAM KELUARGA')

RIW HIPERTENSI/PE DALAM KELUARGA
0    543
1     11
Name: count, dtype: int64

In [50]:
data2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 554 entries, 0 to 560
Data columns (total 12 columns):
 #   Column                            Non-Null Count  Dtype
---  ------                            --------------  -----
 0   NO                                554 non-null    int64
 1   NAMA                              554 non-null    object
 2   USIA                              554 non-null    float64
 3   PARITAS                           554 non-null    int64
 4   JARAK KELAHIRAN                   554 non-null    int64
 5   RIW HIPERTENSI                    554 non-null    int64
 6   RIW PE                            554 non-null    int64
 7   OBESITAS                          554 non-null    int64
 8   RIW DM                            554 non-null    int64
 9   RIW HIPERTENSI/PE DALAM KELUARGA  554 non-null    int64
 10  SOSEK RENDAH                      554 non-null    object
 11  PE/Non PE                         554 non-null    object
dtypes: float64(1), int64(8), object(3)
memory usage: 56.3+ KB

In [51]:
counts('SOSEK RENDAH')

SOSEK RENDAH
>UMR    550
<UMR      4
Name: count, dtype: int64

In [53]:
data2['SOSEK RENDAH']=data2['SOSEK RENDAH'].map({'>UMR':1,'<UMR':0})

In [54]:
counts('SOSEK RENDAH')

SOSEK RENDAH
1    550
0      4
Name: count, dtype: int64

In [55]:
data2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 554 entries, 0 to 560
Data columns (total 12 columns):
 #   Column                            Non-Null Count  Dtype
---  ------                            --------------  -----
 0   NO                                554 non-null    int64
 1   NAMA                              554 non-null    object
 2   USIA                              554 non-null    float64
 3   PARITAS                           554 non-null    int64
 4   JARAK KELAHIRAN                   554 non-null    int64
 5   RIW HIPERTENSI                    554 non-null    int64
 6   RIW PE                            554 non-null    int64
 7   OBESITAS                          554 non-null    int64
 8   RIW DM                            554 non-null    int64
 9   RIW HIPERTENSI/PE DALAM KELUARGA  554 non-null    int64
 10  SOSEK RENDAH                      554 non-null    int64
 11  PE/Non PE                         554 non-null    object
dtypes: float64(1), int64(9), object(2)
memory usage: 56.3+ KB

In [56]:
counts('PE/Non PE')

PE/Non PE
Non PE                    514
PEB                        20
PE                         16
Eklamsia                    1
PE gemelli                  1
PEB impending eklampsi      1
PE                          1
Name: count, dtype: int64

In [57]:
data2['PE/Non PE']= data2['PE/Non PE'].apply(lambda x: 'PE' if x != 'Non PE' else 'Non PE')
data2['PE/Non PE']= data2['PE/Non PE'].map({'PE':1,'Non PE':0})

In [58]:
counts('PE/Non PE')

PE/Non PE
0    514
1     40
Name: count, dtype: int64

In [59]:
data2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 554 entries, 0 to 560
Data columns (total 12 columns):
 #   Column                            Non-Null Count  Dtype
---  ------                            --------------  -----
 0   NO                                554 non-null    int64
 1   NAMA                              554 non-null    object
 2   USIA                              554 non-null    float64
 3   PARITAS                           554 non-null    int64
 4   JARAK KELAHIRAN                   554 non-null    int64
 5   RIW HIPERTENSI                    554 non-null    int64
 6   RIW PE                            554 non-null    int64
 7   OBESITAS                          554 non-null    int64
 8   RIW DM                            554 non-null    int64
 9   RIW HIPERTENSI/PE DALAM KELUARGA  554 non-null    int64
 10  SOSEK RENDAH                      554 non-null    int64
 11  PE/Non PE                         554 non-null    int64
dtypes: float64(1), int64(10), object(1)
memory usage: 56.3+ KB

In [60]:
data2=data2.drop(columns='NO')

In [61]:
data2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 554 entries, 0 to 560
Data columns (total 11 columns):
 #   Column                            Non-Null Count  Dtype
---  ------                            --------------  -----
 0   NAMA                              554 non-null    object
 1   USIA                              554 non-null    float64
 2   PARITAS                           554 non-null    int64
 3   JARAK KELAHIRAN                   554 non-null    int64
 4   RIW HIPERTENSI                    554 non-null    int64
 5   RIW PE                            554 non-null    int64
 6   OBESITAS                          554 non-null    int64
 7   RIW DM                            554 non-null    int64
 8   RIW HIPERTENSI/PE DALAM KELUARGA  554 non-null    int64
 9   SOSEK RENDAH                      554 non-null    int64
 10  PE/Non PE                         554 non-null    int64
dtypes: float64(1), int64(9), object(1)
memory usage: 51.9+ KB

In [62]:
data2.to_csv('Latihan1.csv')

In [63]:
print(data2)

         NAMA  USIA  PARITAS  ...  RIW HIPERTENSI/PE DALAM KELUARGA  SOSEK RENDAH  PE/Non PE
0      NAMA 1  23.0        3  ...                                 0             1          0
1      NAMA 2  29.0        2  ...                                 1             1          1
2      NAMA 3  20.0        1  ...                                 0             1          0
3      NAMA 4  18.0        1  ...                                 0             1          0
4      NAMA 5  34.0        3  ...                                 0             1          0
..        ...   ...      ...  ...                               ...           ...        ...
556  NAMA 557  40.0        3  ...                                 0             1          0
557  NAMA 558  28.0        3  ...                                 0             1          0
558  NAMA 559  41.0        3  ...                                 0             1          0
559  NAMA 560  32.0        2  ...                                 0             1          0
560  NAMA 561  30.0        2  ...                                 0             1          0

[554 rows x 11 columns]